[
  {
    "question_number": 1,
    "question_text": "Education would be meaningful when it is ........ centric.",
    "options": [
      "(A) Curriculum",
      "(B) Society",
      "(C) Student",
      "(D) Teacher"
    ]
  },
  {
    "question_number": 2,
    "question_text": "The strength of project method lies in:",
    "options": [
      "(A) Social participation",
      "(B) Collection of information",
      "(C) Teacher's instructions",
      "(D) Individual engagement"
    ]
  },
  {
    "question_number": 3,
    "question_text": "Continuous and comprehensive and scholaristic evaluation means:",
    "options": [
      "(A) Scholaristic evaluation of students",
      "(B) Physical evaluation of students",
      "(C) Evaluation of students through continuous examination",
      "(D) Evaluation of overall development of students through continuous evaluation"
    ]
  },
  {
    "question_number": 4,
    "question_text": "By using audio-visual teaching aids:",
    "options": [
      "(A) Students become active in classroom learning",
      "(B) Teacher becomes active in teaching",
      "(C) Teaching becomes effective",
      "(D) All of the above"
    ]
  },
  {
    "question_number": 5,
    "question_text": "Main objective of diagnostic test is",
    "options": [
      "(A) to know the content weakness of student",
      "(B) to know the scholastic achievement of student",
      "(C) to do remedial teaching",
      "(D) (A) and (C) both"
    ]
  },
  {
    "question_number": 6,
    "question_text": "Who is a better teacher?",
    "options": [
      "(A) The one strictly following the disciplinary guidelines",
      "(B) The one devoting full time to the school",
      "(C) The one who is interested in overall development of students",
      "(D) The one who develops quality leadership in his students"
    ]
  },
  {
    "question_number": 7,
    "question_text": "Which of the following kinds of research studies does not require sampling?",
    "options": [
      "(A) Ex-post Facto",
      "(B) Experimental",
      "(C) Survey",
      "(D) Case study"
    ]
  },
  {
    "question_number": 8,
    "question_text": "Which of the following pertains to scientific method ?",
    "options": [
      "(A) experiential evidences",
      "(B) hypothetico deduction",
      "(C) a priori exploration",
      "(D) belief in subjectivity of evidence"
    ]
  },
  {
    "question_number": 9,
    "question_text": "Opinion of 'facebook users' on reservation policy in education is to be studied. The most appropriate sampling technique for the purpose is:",
    "options": [
      "(A) Stratified Random Sampling",
      "(B) Snowball Sampling",
      "(C) Cluster Sampling",
      "(D) Quota Sampling"
    ]
  },
  {
    "question_number": 10,
    "question_text": "One's attitude towards knowledge should be:",
    "options": [
      "(A) to accept what is proved by empirical evidence",
      "(B) to accept believing that knowledge leads to improvement",
      "(C) to accept the final truth",
      "(D) not to accept anything that is not personally verified"
    ]
  },
  {
    "question_number": 11,
    "question_text": "Objectivity in research implies:",
    "options": [
      "(A) Correct judgement of truth",
      "(B) Findings consistent with reality",
      "(C) Agreement in results",
      "(D) Methodological sophistication"
    ]
  },
  {
    "question_number": 12,
    "question_text": "The research that aims at immediate application is",
    "options": [
      "(A) Action Research",
      "(B) Empirical Research",
      "(C) Conceptual Research",
      "(D) Fundamental Research"
    ]
  },
  {
    "question_number": 13,
    "question_text": "Find the odd one out",
    "options": [
      "(A) CD ROM",
      "(B) Hard Disk",
      "(C) Pen Drive",
      "(D) RAM"
    ]
  },
  {
    "question_number": 14,
    "question_text": "Radio and TV are more powerful and successful than the newspaper in communicating socially relevant messages because:",
    "options": [
      "(A) they are designed for such purposes",
      "(B) they are capable of catching the attention of people",
      "(C) they present a variety of programmes",
      "(D) they can reach even the illiterate masses"
    ]
  },
  {
    "question_number": 15,
    "question_text": "One significant feature that enhances quality of teacher's communication in classroom is:",
    "options": [
      "(A) low noise level inside and outside classroom",
      "(B) students' level of understanding",
      "(C) teacher's ability to empathise with students",
      "(D) accuracy in the content being communicated"
    ]
  },
  {
    "question_number": 16,
    "question_text": "Full form of PDF is:",
    "options": [
      "(A) Portable Document Format",
      "(B) Portable Document File",
      "(C) Permanent Document Format",
      "(D) Permanent Document File"
    ]
  },
  {
    "question_number": 17,
    "question_text": "The relation of data to information is that of",
    "options": [
      "(A) raw material to its processing",
      "(B) raw material to its quality",
      "(C) raw material to a finished product",
      "(D) both (A) and (B) above"
    ]
  },
  {
    "question_number": 18,
    "question_text": "The set of procedures for handling the information transaction processing systems excludes",
    "options": [
      "(A) calculation",
      "(B) classification",
      "(C) sorting",
      "(D) conclusion"
    ]
  },
  {
    "question_number": 19,
    "question_text": "To disrupt cellphone reception in a specific region jammers are used. This is a tool to obstruct communication at",
    "options": [
      "(A) Receiver level",
      "(B) Sender level",
      "(C) Feedback level",
      "(D) Media level"
    ]
  },
  {
    "question_number": 20,
    "question_text": "The potential of ICT is better utilized when used as a",
    "options": [
      "(A) Teaching Supplement",
      "(B) Teaching Support",
      "(C) Learning Resource",
      "(D) Learning Reinforcement"
    ]
  },
  {
    "question_number": 21,
    "question_text": "Which TV channel is launched to provide technology based real classroom experiences through virtual mode to the distance education learners ?",
    "options": [
      "(A) Gyan Darshan",
      "(B) Eklavya",
      "(C) Vyas",
      "(D) Kisan"
    ]
  },
  {
    "question_number": 22,
    "question_text": "A computer operating system that permits large number of students and teachers to run programs at the same time is known as",
    "options": [
      "(A) Multiprogramming System",
      "(B) Real Time System",
      "(C) Multitasking System",
      "(D) Time Sharing System"
    ]
  },
  {
    "question_number": 23,
    "question_text": "What is the advantage of using database indexes over browsing the internet during research?",
    "options": [
      "(A) Information on database has been checked by the sources that publish it",
      "(B) Database have wide variety of sources",
      "(C) Access to relevant information is faster than the web browsing",
      "(D) Databases are huge"
    ]
  },
  {
    "question_number": 24,
    "question_text": "Which of the following acronyms would normally be used to describe unsolicited junk e-mails?",
    "options": [
      "(A) WHAM",
      "(B) DRAM",
      "(C) CRAM",
      "(D) SPAM"
    ]
  },
  {
    "question_number": 25,
    "question_text": "Insert the missing number in the following sequence 240, .........., 120, 40, 10, 2",
    "options": [
      "(A) 120",
      "(B) 80",
      "(C) 240",
      "(D) 60"
    ]
  },
  {
    "question_number": 26,
    "question_text": "If BUT = 101 and NUT = 1301, then HUT = ?",
    "options": [
      "(A) 501",
      "(B) 701",
      "(C) 901",
      "(D) 1001"
    ]
  },
  {
    "question_number": 27,
    "question_text": "Complete the sequence B, D, G, I, L, N, ......",
    "options": [
      "(A) O",
      "(B) P",
      "(C) Q",
      "(D) R"
    ]
  },
  {
    "question_number": 28,
    "question_text": "What will be the next letters in the following sequence ? CDBA, GHFE, KLJI, ......",
    "options": [
      "(A) OPMN",
      "(B) OPNM",
      "(C) MNLK",
      "(D) PQON"
    ]
  },
  {
    "question_number": 29,
    "question_text": "What will be the next letters in the following sequence ? FEXW, GHVU, JITS, ......",
    "options": [
      "(A) KLRQ",
      "(B) LMRQ",
      "(C) MLQR",
      "(D) KLSR"
    ]
  },
  {
    "question_number": 30,
    "question_text": "Q is shorter than P but taller than R. R is shorter than P but taller than A. W is shorter than A. If they stand in ascending order of their height, the order in which they are standing would be :",
    "options": [
      "(A) ARWQP",
      "(B) WAQRP",
      "(C) WARQP",
      "(D) WARPQ"
    ]
  },
  {
    "question_number": 31,
    "question_text": "Exposure to new ideas will empower masses as it enables them to understand",
    "options": [
      "(A) happenings in the world around",
      "(B) that they need to open their eyes",
      "(C) helps them to demand what is due to them",
      "(D) that they can also learn"
    ]
  },
  {
    "question_number": 32,
    "question_text": "Enhancing the proportion of education and intelligence among the masses can also be called",
    "options": [
      "(A) National programme",
      "(B) Mass education",
      "(C) Development programme",
      "(D) Educational programme"
    ]
  },
  {
    "question_number": 33,
    "question_text": "One major drawback faced by India post-independence was",
    "options": [
      "(A) unwillingness of masses to get educated",
      "(B) concentration of education among smaller sections of population",
      "(C) economic downfall of masses",
      "(D) lack of ideas among the citizens"
    ]
  },
  {
    "question_number": 34,
    "question_text": "Upliftment of masses involves one of the following",
    "options": [
      "(A) everyone works out one's own salvation",
      "(B) introduction of programmes for people's salvation by the Government",
      "(C) freedom given to people to work independently",
      "(D) everyone's eyes open while learning"
    ]
  },
  {
    "question_number": 35,
    "question_text": "Only education can help masses develop as",
    "options": [
      "(A) it makes them learn",
      "(B) it enhances their individuality",
      "(C) it is like putting several chemicals together",
      "(D) it helps them crystallize their efforts"
    ]
  },
  {
    "question_number": 36,
    "question_text": "The passage is in line with the present day view of education as a process of",
    "options": [
      "(A) self help",
      "(B) idea generation",
      "(C) facilitation of learning",
      "(D) crystallisation of ideas"
    ]
  },
  {
    "question_number": 37,
    "question_text": "Which of the following is not a method of water conservation?",
    "options": [
      "(A) Dual flush in toilets",
      "(B) Groundwater recharging",
      "(C) RO and UV treatment of water",
      "(D) Rain water harvesting"
    ]
  },
  {
    "question_number": 38,
    "question_text": "Ozone hole is considered harmful to us because",
    "options": [
      "(A) it can increase global warming",
      "(B) it allows UV radiations to reach earth which may cause skin cancer",
      "(C) it may allow entry of toxic gases from other planets",
      "(D) all the gases will escape from this hole and we will be without oxygen"
    ]
  },
  {
    "question_number": 39,
    "question_text": "Which of the following is not a major source of energy?",
    "options": [
      "(A) fossil fuel",
      "(B) biomass",
      "(C) rains",
      "(D) nuclear energy"
    ]
  },
  {
    "question_number": 40,
    "question_text": "Which of the following is an environmental problem associated with abandoned coal mines ?",
    "options": [
      "(A) thermal pollution of streams in the area",
      "(B) acid drainage due to leaching of soil heaps by rain water",
      "(C) air pollution caused by smog from ozone formation",
      "(D) alkaline solutions that pollute streams"
    ]
  },
  {
    "question_number": 41,
    "question_text": "Climate change may pose health related problems because of",
    "options": [
      "(A) malnutrition due to lack of food",
      "(B) diseases due to increased pests",
      "(C) diseases due to increased population of insect carriers",
      "(D) failure of existing medical facility to control any epidemic"
    ]
  },
  {
    "question_number": 42,
    "question_text": "Which of the following is least likely to be an effect of global warming?",
    "options": [
      "(A) Extinction of some species",
      "(B) Increase in sea water level",
      "(C) Decreased hydrocarbon in plants",
      "(D) Loss of fertile delta regions for agriculture"
    ]
  },
  {
    "question_number": 43,
    "question_text": "To ensure quality in higher education, the NAAC provides",
    "options": [
      "(A) Norms and Regulations",
      "(B) Rules and Procedures",
      "(C) Indicators of quality",
      "(D) Case studies of good institutions"
    ]
  },
  {
    "question_number": 44,
    "question_text": "Which of the following is a regulatory body of technical education in India?",
    "options": [
      "(A) NCTE",
      "(B) MCI",
      "(C) AIU",
      "(D) AICTE"
    ]
  },
  {
    "question_number": 45,
    "question_text": "Distance learning system involves studying courses through",
    "options": [
      "(A) printed learning material in the college library",
      "(B) printed as well as other media at one's place of living",
      "(C) various methods of learning in college",
      "(D) one's own efforts in the college without attending classes"
    ]
  },
  {
    "question_number": 46,
    "question_text": "Universities or Higher Education Institutions like to get accredited by NAAC because",
    "options": [
      "(A) degrees get accepted in the academic world",
      "(B) status of the institution is established",
      "(C) get relative placement in academic world",
      "(D) strengths of university get streamlined"
    ]
  },
  {
    "question_number": 47,
    "question_text": "Continuous and comprehensive evaluation is better than summative evaluation because it",
    "options": [
      "(A) keeps students busy all through the year",
      "(B) gives a progressive picture of students' achievement",
      "(C) helps in improving students' competencies in different areas",
      "(D) would improve the annual result of the class"
    ]
  },
  {
    "question_number": 48,
    "question_text": "Several experts criticise semester system in universities. Which of the following statements best endorses their view?",
    "options": [
      "(A) It does not provide sufficient time for deeper knowledge",
      "(B) It increases the burden of students and teachers",
      "(C) It controls free thinking of students.",
      "(D) The focus is more on earning grades and marks than learning"
    ]
  },
  {
    "question_number": 49,
    "question_text": "What is the average percentage of students per year employed through campus interviews?",
    "options": [
      "(A) 36 17/33",
      "(B) 37",
      "(C) 38",
      "(D) 35"
    ]
  },
  {
    "question_number": 50,
    "question_text": "How many students choose other activities in 2012?",
    "options": [
      "(A) 216",
      "(B) 210",
      "(C) 250",
      "(D) 180"
    ]
  },
  {
    "question_number": 51,
    "question_text": "What is the increase in the number of students going for further studies during 2010-2012?",
    "options": [
      "(A) 300",
      "(B) 30",
      "(C) 112",
      "(D) 110"
    ]
  },
  {
    "question_number": 52,
    "question_text": "The 20% of the total bungalows are white in colour. How many are there?",
    "options": [
      "(A) 10",
      "(B) 8",
      "(C) 6",
      "(D) 12"
    ]
  },
  {
    "question_number": 53,
    "question_text": "How many residences are flat type ?",
    "options": [
      "(A) 20",
      "(B) 30",
      "(C) 35",
      "(D) 45"
    ]
  },
  {
    "question_number": 54,
    "question_text": "From among the 12% independent houses, 50% are facing east direction. How many are they?",
    "options": [
      "(A) 12",
      "(B) 9",
      "(C) 6",
      "(D) 10"
    ]
  },
  {
    "question_number": 55,
    "question_text": "In the following if the smallest circle represents candidates clearing GSET exam, bigger circle represents candidates clearing only Paper-I of the GSET exam and the biggest circle represents the candidates who failed in the GSET exam, then choose the diagram which correctly represents this relationships.",
    "options": [
      "(A) [Diagram A]",
      "(B) [Diagram B]",
      "(C) [Diagram C]",
      "(D) [Diagram D]"
    ]
  },
  {
    "question_number": 56,
    "question_text": "Consider the following statement followed by two assumptions (i) and (ii). Choose the correct answer. Statement : \"You are hereby appointed as a programmer with a probation period of one year and your performance will be reviewed at the end of the period for confirmation.\" A line in an appointment letter. Assumptions : (i) The performance of an individual is generally not known at the time of appointment offer. (ii) Generally an individual tries to prove his/her worth in the probation period.",
    "options": [
      "(A) Only Assumption (i) is implicit.",
      "(B) Only Assumption (ii) is implicit.",
      "(C) None of the assumptions (i) and (ii) are implicit.",
      "(D) Both the Assumptions (i) and (ii) are implicit."
    ]
  },
  {
    "question_number": 57,
    "question_text": "Of the following statements, there are two statements both of which cannot be false but both can be true. Which are these two statements? (i) All the students wish to complete their study. (ii) Some students do not like Mathematics. (iii) No student wishes to complete the study. (iv) No student likes Mathematics.",
    "options": [
      "(A) (i) and (ii)",
      "(B) (iii) and (iv)",
      "(C) (i) and (iii)",
      "(D) (ii) and (iv)"
    ]
  },
  {
    "question_number": 58,
    "question_text": "Evaluate the following statements in terms of whether each is a Fact, Opinion, Prejudice or Advice by choosing correct alternative. (i) Women are not suitable for police service. (ii) In democracy no party should be in power for too long (iii) Have proper rest even during examination time. (iv) Obesity is a risk factor for coronary heart diseases.",
    "options": [
      "(A) (ii) (iii) (iv) (i)",
      "(B) (ii) (i) (iv) (iii)",
      "(C) (iii) (i) (iv) (ii)",
      "(D) (ii) (iv) (iii) (i)"
    ]
  },
  {
    "question_number": 59,
    "question_text": "The question below is followed by two arguments numbered (i) and (ii). Decide which argument is strong. Question: Should India encourage exports when most things are insufficient for internal use itself? Arguments: (i) Yes. We have to earn foreign exchange to pay at least for our defence and other necessary exports. (ii) No. Even selective encouragement will lead to shortages.",
    "options": [
      "(A) Only Argument (i) is strong.",
      "(B) Only Argument (ii) is strong.",
      "(C) Both the Arguments (i) and (ii) are strong.",
      "(D) None of the arguments (i) and (ii) are strong."
    ]
  },
  {
    "question_number": 60,
    "question_text": "Consider the following two statements and choose the correct answer. Statement (i): There has been a high increase in the incidents of atrocities against women in the country during past few years. Statement (ii) : The police authority has been unable to nab the culprits committing crime against women.",
    "options": [
      "(A) Statement (i) is cause and Statement (ii) is effect.",
      "(B) Statement (ii) is cause and Statement (i) is effect.",
      "(C) Statements (i) and (ii) are both independent of causes.",
      "(D) Statements (i) and (ii) are both effects of some independent causes."
    ]
  }
]
